#coding: utf-8
#Задача 1
x = int(input("Введите число x = "))
y = 7*x+5
print("Ответ y = ", y)

#Задача 2
x = int(input("Введите число x =  "))
y = 4*x
print("Ответ y= ",y)

#Задача 3
x = int(input("Введите число x = "))
y = 3,14*2*x 
print("Ответ y =",y )

#Задача 4 
x = int(input("Введите число x = "))
S = 3,14*x*x*2
print("Ответ S = " ,S)

#Задаче 5
x = int(input("Введите число x "))
y = int(input("Введите число y "))
c = 4*4+4*4
print("Ответ c = ",c)

#Задача 6
x = int(input("Введите число x"))
y = int(input("Введите число y "))
P = 2*x+y
print("Ответ P = ",P)

