#coding:utf-8

#Задание 10
i = 28
while i <=600:
    if i % 28 == 0:
        i += 28
        print(i)

#Задание 11
a = 10
b = 1 
while a <=20:
    a += a * 0.1 
    b += 1
print("Лыжник пробежит более 20 кмн на день", b)

#Задание 14
n = 1 
while n * 11 < 100:
    n * 11
    print(n)
    n += 1


